АлогистикТест2/src/DataProcessors/алк_УправлениеСериями/алк_УправлениеСериями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_УправлениеСериями</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрошлыйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСерии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

АлогистикТест2/src/Documents/алк_Производство/алк_Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_Производство</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыОтчетаПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Целевая</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Catalogs/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ОперацииПроизводства</name>
  <predefined>
    <items>
      <name>Досушка</name>
      <description>Досушка</description>
    </items>
    <items>
      <name>Дробление</name>
      <description>Дробление</description>
    </items>
    <items>
      <name>Лущение</name>
      <description>Лущение</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Отгрузка</name>
      <description>Отгрузка</description>
    </items>
    <items>
      <name>ОтгрузкаСудна</name>
      <description>Отгрузка судна</description>
    </items>
    <items>
      <name>ПереданоВОтгрузку</name>
      <description>Передано в отгрузку</description>
    </items>
    <items>
      <name>ПеремещениеПриход</name>
      <description>Перемещение приход</description>
    </items>
    <items>
      <name>ПеремещениеРасход</name>
      <description>Перемещение расход</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортица</description>
    </items>
    <items>
      <name>Переупаковка</name>
      <description>Переупаковка</description>
    </items>
    <items>
      <name>Прибыло</name>
      <description>Прибыло</description>
    </items>
    <items>
      <name>Приемка</name>
      <description>Приемка</description>
    </items>
    <items>
      <name>ПриемкаВПорту</name>
      <description>Приемка в порту</description>
    </items>
    <items>
      <name>ПриемкаПоГОСТ</name>
      <description>Приемка по ГОСТ</description>
    </items>
    <items>
      <name>ПроизводствоПоддонов</name>
      <description>Производство поддонов</description>
    </items>
    <items>
      <name>ПроизводствоТопливныхБрикетов</name>
      <description>Производство топливных брикетов</description>
    </items>
    <items>
      <name>ПроизводствоФанеры</name>
      <description>Производство фанеры</description>
    </items>
    <items>
      <name>Разгружено</name>
      <description>Разгружено</description>
    </items>
    <items>
      <name>Распил</name>
      <description>Распил</description>
    </items>
    <items>
      <name>Ребросклей</name>
      <description>Ребросклей</description>
    </items>
    <items>
      <name>РучнаяСортировка</name>
      <description>Ручная сортировка</description>
    </items>
    <items>
      <name>СборкаРазборкаПакета</name>
      <description>Сборка/Разборка пакета</description>
    </items>
    <items>
      <name>Списание</name>
      <description>Списание</description>
    </items>
    <items>
      <name>Сушка</name>
      <description>Сушка</description>
    </items>
    <items>
      <name>Упаковка</name>
      <description>Упаковка</description>
    </items>
    <items>
      <name>УпаковкаФанеры</name>
      <description>Упаковка фанеры</description>
    </items>
    <items>
      <name>ФорматнаяОбрезка</name>
      <description>Форматная обрезка</description>
    </items>
    <items>
      <name>ЧисленныйСоставСмены</name>
      <description>Численный состав смены (общая)</description>
    </items>
    <items>
      <name>ШлифованиеФанеры</name>
      <description>Шлифование фанеры</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗапросПолученияБюджета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперацииДляЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>63</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИтогов</name>
    <type>
      <types>EnumRef.алк_ВариантыИтогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависитОтОпераций</name>
    <comment>Используется в механизме расчета показателей для настраиваемых отчетов</comment>
    <attributes>
      <name>ОперацияПроизводства</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВТ</name>
    <attributes>
      <name>ВТ</name>
      <type>
        <types>CatalogRef.алк_ВТ_ДляРасчетаПоказателейПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/DataProcessors/алк_УправлениеСериями/ManagerModule.bsl
//используется на форме серийного номера
Функция ВернутьДанныеПоСерийномуНомеру(СерийныйНомер) Экспорт  
	
	Если СтрНайти(СерийныйНомер, "ШП-") > 0 
		ИЛИ СтрНайти(СерийныйНомер, "КШ-") > 0
		ИЛИ СтрНайти(СерийныйНомер, "РВ-") > 0 Тогда		
		ИмяМакетаСКД = "СхКД_шпон"; 	
	ИначеЕсли СтрНайти(СерийныйНомер, "ДГ-") > 0 Тогда		
		ИмяМакетаСКД = "СхКД_ДГ";
	ИначеЕсли СтрНайти(СерийныйНомер, "ИФ-") > 0 Тогда		
		ИмяМакетаСКД = "СхКД_ИФ";
	Иначе 
		ИмяМакетаСКД = "МакетПМ";  
	КонецЕсли;
			
	СхемаКомпоновкиДанных = Обработки.алк_УправлениеСериями.ПолучитьМакет(ИмяМакетаСКД);      		
	ТекстЗапросаМакета = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;    
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаМакета;
	Запрос.УстановитьПараметр("СерийныйНомер",СерийныйНомер);
	Запрос.УстановитьПараметр("Операция",Справочники.алк_ОперацииПроизводства.УпаковкаФанеры);
	
	РезЗ = Запрос.Выполнить();
	
	Если РезЗ.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка;
	КонецЦикла;
	
КонецФункции 

&НаСервере
Функция ВернутьДвиженияПоПакету(СерийныйНомер) Экспорт //используется в этой обработке и на форме серийного номера 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОбороты.ПериодСекунда КАК ДатаСобытия,
	|	алк_ОстаткиЗапасовОбороты.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОстаткиЗапасовОбороты.Регистратор) КАК РегистраторПредставление,
	|	ВЫБОР
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_РасходнаяНакладная
	|			ТОГДА ""Передано в отгрузку""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_ТранспортировкаЗапасов
	|			ТОГДА ""Отгрузка""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_СборкаЗапасов
	|				ИЛИ алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_Производство
	|			ТОГДА ""Производство""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_ПеремещениеЗапасов
	|				ИЛИ алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_Перемещение
	|			ТОГДА ""Перемещение""
	|		ИНАЧЕ ""Прочая""
	|	КОНЕЦ КАК Операция
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(, , Авто, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ОстаткиЗапасовОбороты.ПериодСекунда,
	|	ВЫБОР
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_РасходнаяНакладная
	|			ТОГДА ""Передано в отгрузку""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_ТранспортировкаЗапасов
	|			ТОГДА ""Отгрузка""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_СборкаЗапасов
	|				ИЛИ алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_Производство
	|			ТОГДА ""Производство""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_ПеремещениеЗапасов
	|				ИЛИ алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_Перемещение
	|			ТОГДА ""Перемещение""
	|		ИНАЧЕ ""Прочая""
	|	КОНЕЦ,
	|	алк_ОстаткиЗапасовОбороты.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСобытия";
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);  
			
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
